Documents/csys1_ТехДокументация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>csys1_ТехДокументация</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.csys1_ПодразделениеКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заключение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.csys1_ТипыТехДокументации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИсполнительФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Заказчики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказчикФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДолжностьЗаказчика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/csys1_ТехДокументация/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.csys1_ТехДокументация.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	csys1_ТехДокументация.Дата КАК Дата,
	|	csys1_ТехДокументация.Договор КАК Договор,
	|	csys1_ТехДокументация.Заключение КАК Заключение,
	|	csys1_ТехДокументация.Контрагент КАК Контрагент,
	|	csys1_ТехДокументация.Номер КАК Номер,
	|	csys1_ТехДокументация.Организация КАК Организация,
	|	csys1_ТехДокументация.Организация.НаименованиеСокращенное КАК ОрганизицияНаименование,
	|	csys1_ТехДокументация.Подразделение КАК Подразделение,
	|	csys1_ТехДокументация.ТипДокумента КАК ТипДокумента,
	//|	csys1_ТехДокументация.Исполнители.(
	//|		НомерСтроки КАК НомерСтроки,
	//|		ИсполнительФИО КАК ИсполнительФИО,
	//|		ДолжностьИсполнителя КАК ДолжностьИсполнителя
	//|	) КАК Исполнители,
	//|	csys1_ТехДокументация.Заказчики.(
	//|		НомерСтроки КАК НомерСтроки,
	//|		ЗаказчикФИО КАК ЗаказчикФИО,
	//|		ДолжностьЗаказчика КАК ДолжностьЗаказчика
	//|	) КАК Заказчики,
	//|	csys1_ТехДокументация.Организация.ФайлЛоготип КАК Логотип,
	|	csys1_ТехДокументация.Организация.ИНН КАК ОрганизацияИНН,
	|	csys1_ТехДокументация.Организация.КПП КАК ОрганизацияКПП,
	|	csys1_ТехДокументация.Контрагент.ИНН КАК КонтрагентИНН,
	|	csys1_ТехДокументация.Контрагент.КПП КАК КонтрагентКПП
	|ИЗ
	|	Документ.csys1_ТехДокументация КАК csys1_ТехДокументация
	|ГДЕ
	|	csys1_ТехДокументация.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТабДок.Очистить();
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		
		СведенияОбОрганизации = ОрганизацииСервер.СведенияОбОрганизации(Выборка.Организация);
		
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		//Если НЕ Выборка.Логотип.Пустая() Тогда
		//	ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.Логотип);

		//Если ЗначениеЗаполнено(ДвоичныеДанные) Тогда
		//		КартинкаЛоготипа = Новый Картинка(ДвоичныеДанные);
		//		Шапка.Рисунки.Логотип.Картинка = КартинкаЛоготипа;
		//	КонецЕсли;	
		//КонецЕсли;	

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
        ТабДок.АвтоМасштаб = Истина;


		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
